/*
描述
某医院想统计一下某项疾病的获得与否与年龄是否有关，需要对以前的诊断记录进行整理，按照0-18、19-35、36-60、61以上（含61）四个年龄段统计的患病人数占总患病人数的比例。

输入
共2行，第一行为过往病人的数目n（0 < n <= 100)，第二行为每个病人患病时的年龄。
输出
按照0-18、19-35、36-60、61以上（含61）四个年龄段输出该段患病人数占总患病人数的比例，以百分比的形式输出，精确到小数点后两位。每个年龄段占一行，共四行。
样例输入
10
1 11 21 31 41 51 61 71 81 91
样例输出
20.00%
20.00%
20.00%
40.00%
*/

#include <iostream>
#include <cstdio>
using namespace std;
int main(){
    int n,t1=0,t2=0,t3=0,t4=0;
    scanf("%d", &n);
    int a[n];
    for( int i=0; i<n; i++ ){
        cin >>a[i];
    }
    for( int i=0; i<n; i++ ){
        if( a[i]>=0 && a[i]<=18 ){
            t1++;
        }else if( a[i]>=19 && a[i]<=35 ){
            t2++;
        }else if( a[i]>=36 && a[i]<=60 ){
            t3++;
        }else{
            t4++;
        }
    }
    printf("%.2f%c\n", 1.0*t1/n*100, '%');
    printf("%.2f%c\n", 1.0*t2/n*100, '%');
    printf("%.2f%c\n", 1.0*t3/n*100, '%');
    printf("%.2f%c\n", 1.0*t4/n*100, '%');
}